app/Controllers/Buku.php

SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '0'
---
    public function delete($id)
    {
        if (!$id) {
            return redirect()->to('/buku');
        }

        // hapus relasi dulu (AMAN)
        $this->db->table('buku_rak')
            ->where('id_buku', $id)
            ->delete();