app/Controllers/Buku.php

    public function index()
{
    $keyword = $this->request->getGet('keyword');

    $builder = $this->buku->getBukuPaginate($keyword);

    return view('buku/index', [
        'buku' => $this->buku->paginate(10), // ✅ paginate dari MODEL
        'pager' => $this->buku->pager,
        'keyword' => $keyword
    ]);
---
SELECT `buku`.*, `kategori`.`nama_kategori`, `penulis`.`nama_penulis`, `penerbit`.`nama_penerbit`, `rak`.`nama_rak`, `rak`.`lokasi`
FROM `buku`
LEFT JOIN `kategori` ON `kategori`.`id_kategori` = `buku`.`id_kategori`
LEFT JOIN `penulis` ON `penulis`.`id_penulis` = `buku`.`id_penulis`
LEFT JOIN `penerbit` ON `penerbit`.`id_penerbit` = `buku`.`id_penerbit`
LEFT JOIN `buku_rak` ON `buku_rak`.`id_buku` = `buku`.`id_buku`
LEFT JOIN `rak` ON `rak`.`id_rak` = `buku_rak`.`id_rak`

    public function detail($id)
{
    $buku = $this->db->table('buku')
        ->select('
            buku.*,
            kategori.nama_kategori,
            penulis.nama_penulis,
            penerbit.nama_penerbit,
            rak.nama_rak
        ')
        ->join('kategori', 'kategori.id_kategori = buku.id_kategori', 'left')
        ->join('penulis', 'penulis.id_penulis = buku.id_penulis', 'left')
        ->join('penerbit', 'penerbit.id_penerbit = buku.id_penerbit', 'left')
        ->join('buku_rak', 'buku_rak.id_buku = buku.id_buku', 'left')
        ->join('rak', 'rak.id_rak = buku_rak.id_rak', 'left')
        ->where('buku.id_buku', $id)
        ->get()
        ->getRowArray();

    if (!$buku) {
        return redirect()->to('/buku')->with('error', 'Data tidak ditemukan');
---
SELECT *
FROM `buku`
WHERE `buku`.`id_buku` = '0'
SELECT *
FROM `kategori`
SELECT *
FROM `penulis`
SELECT *
FROM `penerbit`

    public function update($id)
    {
        $buku = $this->buku->find($id);

        if (!$buku) {
            return redirect()->to('/buku')->with('error', 'Data tidak ditemukan');
        }

        $file = $this->request->getFile('cover');
        $namaFile = $buku['cover'];

        if ($file && $file->isValid() && !$file->hasMoved()) {
            if (!empty($namaFile) && file_exists(FCPATH . 'uploads/buku/' . $namaFile)) {
                unlink(FCPATH . 'uploads/buku/' . $namaFile);
            }

            $namaFile = $file->getRandomName();
            $file->move('uploads/buku', $namaFile);
        }

        $lama = (int)$buku['jumlah'];
        $baru = (int)$this->request->getPost('jumlah');

        $this->buku->update($id, [
            'isbn' => $this->request->getPost('isbn'),
            'judul' => $this->request->getPost('judul'),
            'id_kategori' => $this->request->getPost('id_kategori'),
            'id_penulis' => $this->request->getPost('id_penulis'),
            'id_penerbit' => $this->request->getPost('id_penerbit'),
            'tahun_terbit' => $this->request->getPost('tahun_terbit'),
            'jumlah' => $baru,
            'tersedia' => $buku['tersedia'] + ($baru - $lama),
            'deskripsi' => $this->request->getPost('deskripsi'),
            'cover' => $namaFile
        ]);
---
UPDATE `buku` SET `judul` = 'Laskar Pelangi ', `isbn` = '9781234567890', `id_kategori` = '1', `id_penulis` = '1', `id_penerbit` = '1', `tahun_terbit` = '2003', `jumlah` = '4', `tersedia` = '4', `deskripsi` = 'Andrea Hirata adalah pemenang pertama penghargaan sastra New York Book Festival 2013 untuk The Rainbow Troops, Laskar Pelangi edisi Amerika, penerbit Farrar, Straus & Giroux, New York, kategori general fiction, dan pemenang pertama Buchawards 2013, Jerman, untuk Die Regenbogen Truppe, Laskar Pelangi edisi Jerman, penerbit Hanser Berlin. Dia juga pemenang seleksi short story majalah sastra terkemuka di Amerika, Washington Square Review, New York University, edisi winter/spring 2011 untuk short story pertamanya Dry Season. Tahun 2015 dia dianugerahi gelar Doktor Honoris Causa di bidang sastra oleh University of Warwick, UK dan Tahun 2017 menerima penghargaan budaya dari pemerintah Perancis untuk karyanya Les Guerriers de L\'arc-en-ciel (Laskar Pelangi edisi Prancis, penerbit Mercure de France). Laskar Pelangi telah diadaptasi dalam bentuk film, musikal, lagu, serial TV dan koreografi oleh City Dance Company, Washington, DC serta dilayarkan di Berlinale dan Smithsonian.', `cover` = '1776443506_44824e4464797ac9f6e4.jpg'
WHERE `buku`.`id_buku` IN ('0')