app/Controllers/Buku.php

    public function edit($id)
    {
        return view('buku/edit', [
            'buku' => $this->buku->find($id),
            'kategori' => $this->db->table('kategori')->get()->getResultArray(),
            'penulis' => $this->db->table('penulis')->get()->getResultArray(),
            'penerbit' => $this->db->table('penerbit')->get()->getResultArray(),
---
SELECT *
FROM `penulis`
SELECT *
FROM `penerbit`