app/Controllers/Kategori.php

    public function index()
{
    $keyword = $this->request->getGet('keyword');

    $kategori = $this->kategori;

    if ($keyword) {
        $kategori = $kategori->like('nama_kategori', $keyword);
    }

    $data['kategori'] = $kategori->paginate(10);
---
SELECT *
FROM `kategori`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `kategori`

    public function store()
    {
        $this->kategori->save([
            'nama_kategori' => $this->request->getPost('nama_kategori')
        ]);
---
INSERT INTO `kategori` (`nama_kategori`) VALUES ('Komik')