app/Controllers/Users.php

SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        $keyword = $this->request->getGet('keyword');
        $role    = $this->request->getGet('role');

        $builder = $this->users;

        if ($keyword) {
            $builder = $builder->like('nama', $keyword);
        }

        if ($role) {
            $builder = $builder->where('role', $role);
        }

        $data['users'] = $builder->paginate(10);

SELECT *
FROM `users`
WHERE `users`.`id` = '5'
---
    public function delete($id)
    {
        $user = $this->users->find($id);