app/Models/DashboardModel.php

SELECT COUNT(*) AS `numrows`
FROM `buku`
---
    public function totalBuku()
    {
        return $this->db->table('buku')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `peminjaman`
---
    public function totalPeminjaman()
    {
        return $this->db->table('peminjaman')->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function totalUser()
    {
        return $this->db->table('users')->countAllResults();