app/Models/PeminjamanModel.php

SELECT `peminjaman`.*, `buku`.`judul`, `users`.`nama` as `anggota`, `pet`.`nama` as `petugas`
FROM `peminjaman`
JOIN `detail_peminjaman` ON `detail_peminjaman`.`id_peminjaman` = `peminjaman`.`id_peminjaman`
JOIN `buku` ON `buku`.`id_buku` = `detail_peminjaman`.`id_buku`
JOIN `anggota` ON `anggota`.`id_anggota` = `peminjaman`.`id_anggota`
JOIN `users` ON `users`.`id` = `anggota`.`user_id`
JOIN `petugas` ON `petugas`.`id_petugas` = `peminjaman`.`id_petugas`
JOIN `users` as `pet` ON `pet`.`id` = `petugas`.`user_id`
---
    public function getFullData()
    {
        return $this->db->table('peminjaman')
            ->select('
                peminjaman.id_peminjaman,
                peminjaman.tanggal_pinjam,
                peminjaman.tanggal_kembali,
                peminjaman.status,
                users.nama as anggota,
                GROUP_CONCAT(buku.judul SEPARATOR ", ") as daftar_buku
            ')
            ->join('detail_peminjaman dp', 'dp.id_peminjaman = peminjaman.id_peminjaman')
            ->join('buku', 'buku.id_buku = dp.id_buku')
            ->join('anggota a', 'a.id_anggota = peminjaman.id_anggota')
            ->join('users', 'users.id = a.user_id')
            ->groupBy('peminjaman.id_peminjaman')
            ->orderBy('peminjaman.id_peminjaman', 'DESC')
            ->get()
            ->getResultArray();