app/Models/UsersModel.php

SELECT *
FROM `users`
WHERE `username` = 'mutiaralaila'
 LIMIT 1
---
    public function getUsersByUsername($username)
    {
        return $this->where('username', $username)->first();